#-*- coding:utf-8 –*-

var1='上海#DQ,王品,港丽,香天下,海底捞,COSTA,釜山,新石器,避风塘'
var2='广州#DQ,王品,海底捞,禾绿,真功夫,西贝,探鱼,72街,港丽'
var3='深圳#DQ,王品,海底捞,绿茶,禾绿,西贝,太兴,肯德基,探鱼'
var4='珠海#海底捞,小南国,肯德基,味千拉面,黄记煌,海清纯,北方印象,润鼎四季,汉拿山'
var5='厦门#豪客来,肯德基,哈根达斯,海底捞,大丰收,DQ,王品,小肥羊,陶乡'
var6='佛山#探鱼,肯德基,王子厨房,海底捞,太艮堡毋,卡朋西餐,杯子江,黄记煌,拉亚汉堡'
var7='福州#豪客来,肯德基,哈根达斯,海底捞,大丰收,周麻婆,斗牛士,胖哥俩,石山水'
var8='泉州#豪客来,肯德基,哈根达斯,海底捞,大丰收,桥亭,徽煌新派,汉拿山,星洲蕉叶'
var9='北京#王品,鹿港小镇,金凤呈祥,江边城外,呷哺呷哺,海底捞,将太无二,眉州东坡,味多美'
var10='青岛#DQ,肯德基,哈根达斯,海底捞,豪客来,le,living,渔家灯火,一槿,牛道'
var11='天津#一鼎鲜,肯德基,哈根达斯,海底捞,弄堂里,九毛九,鹿港小镇,太兴,呷哺呷哺'
var12='苏州#DQ,肯德基,呷哺呷哺,海底捞,豪客来,避风塘,蜜桃餐厅,绿茶,海角柒号'
var13='济南#DQ,肯德基,哈根达斯,海底捞,豪客来,九月天,小城故事,黄三怪,福泉码头'
var14='烟台#DQ,肯德基,哈根达斯,海底捞,呷哺呷哺,小滋味,多嘴肉蟹堡,渔家灯火,皇城根'
var15='郑州#拉亚汉堡,肯德基,哈根达斯,海底捞,豪客来,花千代烤鱼,华豫川,鲜芋仙,呷哺呷哺'
var16='大连#水货,肯德基,哈根达斯,海底捞,巴黎贝甜,呷哺呷哺,北季妈妈菜,鹿港小镇,元祖'
var17='沈阳#陈火锅,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,炉鱼,好利来,将太无二'
var18='哈尔滨#辣莊火锅,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,黄记煌,禾绿,米旗食品'
var19='成都#廖记棒棒鸡,肯德基,哈根达斯,海底捞,豪客来,一洋刺身,绿茶,探鱼,黄记煌'
var20='重庆#DQ,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,小天鹅,胖哥俩,鱼旨寿司'
var21='武汉#川霸味道,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,黄记煌,DQ,半秋山'
var22='西安#DQ,肯德基,哈根达斯,海底捞,豪客来,烤肉一筋,小肥羊,绿茶,探鱼'
var23='南通#DQ,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,江边城外,新石器,棒约翰'
var24='长沙#探鱼,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,新一番,川锅一号,鲜天下'
var25='昆明#辣芙蓉,肯德基,哈根达斯,海底捞,满记甜品,红蕃干锅,DQ,西贡小姐,表哥茶餐厅'
var26='东莞#元通寿司,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,探鱼,康师傅'
var27='兰州#比格,肯德基,哈根达斯,海底捞,嗨内嗨外,水货,DQ,凤栖梧茶楼,四季渔歌'
var28='太原#好利来,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,唐久,小天鹅'
var29='长春#东方火锅,阿尔卑斯,哈根达斯,海底捞,食间牛排,香谷私厨,探鱼,春园烤肉,老昌春饼'
var30='南宁#雨石阁,肯德基,哈根达斯,海底捞,豪客来,遇咖啡,DQ,小肥羊,到长沙'
var31='潍坊#汉拿山,烤夫王,金茂,满江红,哈根达斯'
var32='威海#哈根达斯,棒约翰'
var33='乌鲁木齐#康师傅'
var34='南京#鹿港小镇,肯德基,costa,海底捞,豪客来,呷哺呷哺,DQ,味千拉面,南京大牌档'
var35='芜湖#寻味料理,爱茜茜里,哈根达斯,海底捞,长亭咖啡,呷哺呷哺,DQ,济州岛,新石器'
var36='贵阳#釜山料理,肯德基,哈根达斯,禾绿,康师傅,上井料理,DQ,鱼旨寿司,百度烤肉'
var37='呼和浩特#阿尔卑斯,肯德基,哈根达斯,海底捞,蜀江烤鱼,拿渡,欢乐牧场,老上居,麻哥辣妹'
var38='包头#小肥羊,汉拿山,哈根达斯,海底捞,豪客来'
var39='石家庄#黄牛党,肯德基,哈根达斯,海底捞,一茶一坐,呷哺呷哺,DQ,碳族,蜜粤'
var40='中山#禾绿,太平洋咖啡,哈根达斯,海底捞,真功夫'
var41='常州#新石器,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,大丰收,西堤厚牛排'
var42='杭州#名人名家,三上料理,弄堂里,海底捞,豪客来,肯德基,DQ,第二乐章,避风塘'
var43='绍兴#新石器,肯德基,哈根达斯,海底捞,爱茜茜里,大丰收,DQ,康师傅,王品'
var44='淄博#禾绿,新石器,哈根达斯,渔寿司,豪客来,桓台蜀国烤鱼,汉拿山,太平洋咖啡,上岛咖啡'
var45='台州#小肥羊,肯德基,哈根达斯,新石器,豪客来'
var46='宜昌#豪客来,DQ,哈根达斯'
var47='黄石#汉拿山,过锅瘾,思味黄牛庄,凯威啤酒屋'
var48='惠州#王品,禾绿,哈根达斯,真功夫'
var49='赣州#新石器,德庄火锅,哈根达斯,太平洋咖啡,禾绿,玉林串串香'
var50='扬州#江边城外,新石器,哈根达斯,海底捞,豪客来,汉拿山,DQ'
var51='泰州#新石器,汉拿山,哈根达斯,海底捞,豪客来'
var52='宁波#王品,肯德基,哈根达斯,海底捞,豪客来,探鱼,DQ,西贝,炉鱼'
var53='镇江#豪客来,汉拿山,大丰收,海底捞'
var54='襄阳#肯德基,兄弟爬爬虾,黄牛庄,小猩猩烤肉,阿波罗'
var55='济宁#汉拿山'
var56='东营#哈根达斯'
var57='温州#王品,到长沙,太平洋咖啡,拉芳舍,豪客来,新石器,DQ,康师傅,万岁寿司'
var58='合肥#表哥茶餐厅,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,青年餐厅,香天下'
var59='南昌#尊品牛排,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,小资生活,太平洋咖啡'
var60='无锡#香天下,肯德基,哈根达斯,海底捞,豪客来,呷哺呷哺,DQ,快乐柠檬,避风塘'



list = {var1,var2,var3,var4,var5,var6,var7,var8,var9,var10,var11,var12,var13,var14,var15,var16,var17,var18,var19,var20,var21,var22,var23,var24,var25,var26,var27,var28,var29,var30,var31,var32,var33,var34,var35,var36,var37,var38,var39,var40,var41,var42,var43,var44,var45,var46,var47,var48,var49,var50,var51,var52,var53,var54,var55,var56,var57,var58,var59,var60}

f = open("C:\Users\wangtingbang\Desktop\hot.sql", "w")
for a in list:
    #print a
    mer = "DQ"
    city = a.split("#")[0]
    merTmp = a.split("#")[1]
    sql = "INSERT INTO t_srh_user_word_his VALUES(REPLACE( uuid() ,'-' ,'' ) , '1' , '"+mer+"' , (select city_id from t_bas_city_info where city_name = '"+city+"') , NOW() , '0' , '0' );"
    # print sql
    mer_s = merTmp.split(",")
    for mer in mer_s:
        #print city,  mer
        sql = "INSERT INTO t_srh_user_word_his VALUES(REPLACE( uuid() ,'-' ,'' ) , '1' , '" + mer + "' , (select city_id from t_bas_city_info where city_name = '" + city + "') , NOW() , '0' , '0' );\n"
        i = 0
        while i < 20:
            print sql
            i+=1
            f.write(sql)

f.close()

